CREATE SCHEMA `eis` DEFAULT CHARACTER SET utf8 ;

--來人洽詢資料下拉選項
--
insert into t_sys_dict values('83','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','洽詢類別','0','0','');
insert into t_sys_dict values('84','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','電訪','A','83','');
insert into t_sys_dict values('85','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','來電','B','83','');
insert into t_sys_dict values('86','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','初訪','C','83','');
insert into t_sys_dict values('87','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','複訪','D','83','');
insert into t_sys_dict values('88','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','來人','E','83','');
insert into t_sys_dict values('89','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','回籠','F','83','');
insert into t_sys_dict values('90','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','小訂','G','83','');
insert into t_sys_dict values('91','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','大訂','H','83','');
insert into t_sys_dict values('92','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','簽約','I','83','');
insert into t_sys_dict values('93','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','退戶','J','83','');
insert into t_sys_dict values('94','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','83','');
--
insert into t_sys_dict values('102','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','性別選項','0','0','');
insert into t_sys_dict values('103','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','男','M','102','');
insert into t_sys_dict values('104','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','女','F','102','');
--
insert into t_sys_dict values('105','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','年齡選項','0','0','');
insert into t_sys_dict values('106','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','25以下','A','105','');
insert into t_sys_dict values('107','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','26～30','B','105','');
insert into t_sys_dict values('108','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','31～35','C','105','');
insert into t_sys_dict values('109','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','36～40','D','105','');
insert into t_sys_dict values('110','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','41～45','E','105','');
insert into t_sys_dict values('111','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','46～50','F','105','');
insert into t_sys_dict values('112','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','51～55','G','105','');
insert into t_sys_dict values('113','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','56～以上','H','105','');
--
insert into t_sys_dict values('114','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','職業選項','0','0','');
insert into t_sys_dict values('115','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','公務人員','A','114','');
insert into t_sys_dict values('116','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','軍警人員','B','114','');
insert into t_sys_dict values('117','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','教師','C','114','');
insert into t_sys_dict values('118','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','醫護人員','D','114','');
insert into t_sys_dict values('119','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','保險業','E','114','');
insert into t_sys_dict values('120','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','金融業','F','114','');
insert into t_sys_dict values('121','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','服務業','G','114','');
insert into t_sys_dict values('122','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','自由業','H','114','');
insert into t_sys_dict values('123','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','製造業','I','114','');
insert into t_sys_dict values('124','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','企業主管','J','114','');
insert into t_sys_dict values('125','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','電子業','K','114','');
insert into t_sys_dict values('126','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','自營商','L','114','');
insert into t_sys_dict values('127','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','上班族','M','114','');
insert into t_sys_dict values('128','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','大眾傳播','N','114','');
insert into t_sys_dict values('129','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','家庭主婦','O','114','');
insert into t_sys_dict values('130','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','退休人員','P','114','');
insert into t_sys_dict values('131','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','114','');

insert into t_sys_dict values('132','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','區域選項','0','0','');
insert into t_sys_dict values('133','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','梧棲','A1','132','');
insert into t_sys_dict values('134','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','清水','A2','132','');
insert into t_sys_dict values('135','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','沙鹿','A3','132','');

insert into t_sys_dict values('136','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','媒體選項','0','0','');
insert into t_sys_dict values('137','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','NP蘋果','A','136','');
insert into t_sys_dict values('138','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','NP其他','B','136','');
insert into t_sys_dict values('139','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','路過','C','136','');

insert into t_sys_dict values('140','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','婚姻選項','0','0','');
insert into t_sys_dict values('141','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','未婚','A','140','');
insert into t_sys_dict values('142','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','已婚','B','140','');
insert into t_sys_dict values('143','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','單親','C','140','');

insert into t_sys_dict values('144','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','現住狀況選項','0','0','');
insert into t_sys_dict values('145','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','自用','A','144','');
insert into t_sys_dict values('146','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','租賃','B','144','');
insert into t_sys_dict values('147','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','宿舍','C','144','');
insert into t_sys_dict values('148','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','144','');

insert into t_sys_dict values('149','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','詢問重點選項','0','0','');
insert into t_sys_dict values('150','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','地點','A','149','');
insert into t_sys_dict values('151','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','坪數','B','149','');
insert into t_sys_dict values('152','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','價格','C','149','');
insert into t_sys_dict values('153','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','貸款','D','149','');
insert into t_sys_dict values('154','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','建材','E','149','');
insert into t_sys_dict values('155','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','交通','F','149','');
insert into t_sys_dict values('156','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','單價','G','149','');
insert into t_sys_dict values('157','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','H','149','');
insert into t_sys_dict values('158','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','座向','I','149','');
insert into t_sys_dict values('159','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','工期','J','149','');
insert into t_sys_dict values('160','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','車位','K','149','');
insert into t_sys_dict values('161','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','信譽','L','149','');
insert into t_sys_dict values('162','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','公設','M','149','');
insert into t_sys_dict values('163','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','付款方式','N','149','');
insert into t_sys_dict values('164','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','金融機構','O','149','');
insert into t_sys_dict values('165','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','149','');

insert into t_sys_dict values('166','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','購買用途選項','0','0','');
insert into t_sys_dict values('167','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','自用','A','166','');
insert into t_sys_dict values('168','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','首次','B','166','');
insert into t_sys_dict values('169','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','換屋','C','166','');
insert into t_sys_dict values('170','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','贈與','D','166','');
insert into t_sys_dict values('171','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','投資','E','166','');
insert into t_sys_dict values('172','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','幫別人看','F','166','');
insert into t_sys_dict values('173','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','166','');

insert into t_sys_dict values('174','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','屋型','0','0','');
insert into t_sys_dict values('175','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','透天店舖','A','174','');
insert into t_sys_dict values('176','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','透天別墅','B','174','');
insert into t_sys_dict values('177','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','大樓店舖','C','174','');
insert into t_sys_dict values('178','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','大樓住家','D','174','');
insert into t_sys_dict values('179','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','174','');

insert into t_sys_dict values('180','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','格局','0','0','');
insert into t_sys_dict values('181','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','套房','A','180','');
insert into t_sys_dict values('182','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','二房','B','180','');
insert into t_sys_dict values('183','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','三房','C','180','');
insert into t_sys_dict values('184','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','四房','D','180','');
insert into t_sys_dict values('185','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','五房','E','180','');
insert into t_sys_dict values('186','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','樓中樓','F','180','');
insert into t_sys_dict values('187','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','店舖','G','180','');
insert into t_sys_dict values('188','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','180','');

insert into t_sys_dict values('189','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','需求價位選項','0','0','');
insert into t_sys_dict values('190','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','800萬以內','A','189','');
insert into t_sys_dict values('191','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','800~1000萬','B','189','');
insert into t_sys_dict values('192','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','1000~1200萬','C','189','');
insert into t_sys_dict values('193','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','1200~1500萬','D','189','');
insert into t_sys_dict values('194','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','1500~1800萬','E','189','');
insert into t_sys_dict values('195','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','1800~2200萬','F','189','');
insert into t_sys_dict values('196','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','2200萬以上','G','189','');

insert into t_sys_dict values('197','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','需求坪數選項','0','0','');
insert into t_sys_dict values('198','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','20坪以下','A','197','');
insert into t_sys_dict values('199','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','21~~30坪','B','197','');
insert into t_sys_dict values('200','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','31~40坪','C','197','');
insert into t_sys_dict values('201','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','41~50坪','D','197','');
insert into t_sys_dict values('202','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','51~60坪','E','197','');
insert into t_sys_dict values('203','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','60~80坪','F','197','');
insert into t_sys_dict values('204','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','80~100坪','G','197','');
insert into t_sys_dict values('205','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','100坪以上','H','197','');

insert into t_sys_dict values('206','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','車位需求選項','0','0','');
insert into t_sys_dict values('207','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','有需要','A','206','');
insert into t_sys_dict values('208','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','無需要','B','206','');

insert into t_sys_dict values('209','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','已購原因選項','0','0','');
insert into t_sys_dict values('210','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','公司品牌','A','209','');
insert into t_sys_dict values('211','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','地段環境','B','209','');
insert into t_sys_dict values('212','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','產品規劃','C','209','');
insert into t_sys_dict values('213','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','生活機能','D','209','');
insert into t_sys_dict values('214','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','低自備款','E','209','');
insert into t_sys_dict values('215','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','優質學區','F','209','');
insert into t_sys_dict values('216','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','交通便利','G','209','');
insert into t_sys_dict values('217','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','負擔輕鬆','H','209','');
insert into t_sys_dict values('218','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','工作環境','I','209','');
insert into t_sys_dict values('219','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','209','');

insert into t_sys_dict values('220','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','未購原因選項','0','0','');
insert into t_sys_dict values('221','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','單價過高','A','220','');
insert into t_sys_dict values('222','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','產品不符','B','220','');
insert into t_sys_dict values('223','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','個案比較','C','220','');
insert into t_sys_dict values('224','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','自備不足','D','220','');
insert into t_sys_dict values('225','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','家人反對','E','220','');
insert into t_sys_dict values('226','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','決策未到','F','220','');
insert into t_sys_dict values('227','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','地段環境','G','220','');
insert into t_sys_dict values('228','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','考慮評估','H','220','');
insert into t_sys_dict values('229','1','2021-02-04 21:01:01','1','2021-02-04 21:01:01','其他','Z','220','');



-- Table structure for `sla00`
-- ----------------------------
DROP TABLE IF EXISTS `sla00`;
CREATE TABLE `sla00` (
   `id` int NOT NULL AUTO_INCREMENT COMMENT '房屋銷售案基本資料唯一識別碼',
   `sla00002` varchar(20) DEFAULT '' COMMENT '房屋銷售案代號',
   `sla00003` varchar(50) DEFAULT '' COMMENT '房屋銷售案名稱',
   `sla00004` varchar(200) DEFAULT '' COMMENT '基地地號',
   `sla00005` varchar(8) DEFAULT '' COMMENT '工地開工日期',
   `sla00006` varchar(8) DEFAULT '' COMMENT '工地完工日期',
   `sla00007` varchar(8) DEFAULT '' COMMENT '進場日期',
   `sla00009` varchar(8) DEFAULT '' COMMENT '結案日期',
   `sla00010` int DEFAULT 0 COMMENT '銷售日數',
   `sla00011` int DEFAULT 0 COMMENT '可售透天店面數',
   `sla00012` int DEFAULT 0 COMMENT '可售透天住家數',
   `sla00013` int DEFAULT 0 COMMENT '可售大樓店面數',
   `sla00014` int DEFAULT 0 COMMENT '可售大樓住家數',
   `sla00015` int DEFAULT 0 COMMENT '可售平面汽車停車位數',
   `sla00016` int DEFAULT 0 COMMENT '可配平面機車停車位數',
   `sla00017` int DEFAULT 0 COMMENT '可售機械汽車停車位數',
   `sla00018` int DEFAULT 0 COMMENT '售出透天店面數',
   `sla00019` int DEFAULT 0 COMMENT '售出透天住家數',
   `sla00020` int DEFAULT 0 COMMENT '售出大樓店面數',
   `sla00021` int DEFAULT 0 COMMENT '售出大樓住家數',
   `sla00022` int DEFAULT 0 COMMENT '售出平面汽車停車位數',
   `sla00023` int DEFAULT 0 COMMENT '已配平面機車停車位數',
   `sla00024` int DEFAULT 0 COMMENT '售出機械汽車停車位數',
   `sla00025` int DEFAULT 0 COMMENT '累計來人數',
   `sla00026` int DEFAULT 0 COMMENT '累計來電數',
   `sla00027` int DEFAULT 0 COMMENT '可銷總金額',
   `sla00028` int DEFAULT 0 COMMENT '底價總銷',
   `sla00029` int DEFAULT 0 COMMENT '表價總綃',
   `sla00030` int DEFAULT 0 COMMENT '廣告預算',
   `sla00031` int DEFAULT 0 COMMENT '完簽總銷',
   `sla00032` int DEFAULT 0 COMMENT '底銷-扣超價',
   `sla00033` int DEFAULT 0 COMMENT '超價-扣退戶',
   `sla00034` int DEFAULT 0 COMMENT '裝潢費用-總銷',
   `sla00035` int DEFAULT 0 COMMENT '仲人費用',
   `sla00036` int DEFAULT 0 COMMENT '裝潢工程費用-超價',
   `sla00037` int DEFAULT 0 COMMENT '累計開銷金額',
   `sla00038` int DEFAULT 0 COMMENT '價差金額',
   `sla00039` double DEFAULT 0 COMMENT '總超價%',
   `sla00040` double DEFAULT 0 COMMENT '比例',
   `sla00041` char(1) DEFAULT "" COMMENT '銷售狀態碼',
   `sla00042` char(1) DEFAULT "" COMMENT '結案狀態碼',
   `sla00043` varchar(100) DEFAULT "" COMMENT '保留欄位1',
   `sla00044` varchar(100) DEFAULT "" COMMENT '保留欄位2',
   `sla00045` varchar(100) DEFAULT "" COMMENT '保留欄位3',
   `sla00046` varchar(100) DEFAULT "" COMMENT '保留欄位4',
   `sla00047` varchar(100) DEFAULT "" COMMENT '保留欄位5',
   `sla00048` char(1) DEFAULT "" COMMENT '資料狀態',
   `create_by` varchar(10) DEFAULT "" COMMENT '建立人工號',
   `create_time` varchar(20) DEFAULT "" COMMENT '建立日期時間',
   `modify_by` varchar(10) DEFAULT "" COMMENT '異動人工號',
   `modify_time` varchar(20) DEFAULT "" COMMENT '異動日期時間',
  PRIMARY KEY (`id`))
  COMMENT = '房屋銷售案基本資料表';